---
kind: type
id: T:Autodesk.Revit.DB.WorksharingTooltipInfo
source: html/64e2bf53-2787-6cb7-ac29-b73777892ed3.htm
---
# Autodesk.Revit.DB.WorksharingTooltipInfo

Worksharing information about a single element suitable for display in an in-canvas tooltip.

## Syntax (C#)
```csharp
public class WorksharingTooltipInfo : IDisposable
```

## Remarks
Some or all of the strings may be empty.